# 백 트 래 킹
# 기본적으로 상하좌우대각선 고려해서 퀸 놓을 때마다 상하죄우대각선 전부 1로 변경하고 0인 곳 중에서 다시 탐색하는데,
# 이거 재귀로 구현하는 건 어떨까싶은데
# 방문처리 하고 / 풀어주고 두 가지 경우로 해서
# 계속 들어가게 하면 될 거 같은데?
def 퀸찾기(n):
    global 가로, 아래대각, 위대각
    global cnt
    if n==N:
        cnt += 1
        return

    for i in range(N):

        if 가로[i] and 위대각[n+i] and 아래대각[n-i+N-1]: # 세로축은 i로 도는 부분. 가로와 대각선의 방문여부 확인해서 방문이 가능할 때만 돌기
            # 올라가는 대각선은 항상 가로와 세로의 합이 같기 때문에 n+i
            # 내려가는 대각선은 가로와 세로의 차이가 일정함. 최대값은 2N-1


            가로[i] = False
            위대각[n+i] = False
            아래대각[n-i+N-1] = False

            퀸찾기(n+1) # 방문처리하고 재귀돌기

            # 그 다음에 다시 방문할 수 있도록 다시 풀어주기. 순열 만드는 것과 비슷함
            가로[i] = True
            위대각[n+i] = True
            아래대각[n-i+N-1] = True

cnt = 0

N = int(input())


가로 = [True]*N
아래대각 = [True]*(2*N-1) # 대각선의 길이는 둘 다 2N-1.
위대각 = [True]*(2*N-1)



퀸찾기(0)

print(cnt)